[
  {
    "id": "onYourTurn",
    "name": "On your turn",
    "order": 0,
    "contents": [
      {
        "id": "action",
        "name": "Action",
        "parentId": "onYourTurn",
        "order": 0,
        "description": "An action such as attack or cast a spell. You may choose to either use an action or move first.",
        "iconType": "swordwoman"
      },
      {
        "id": "move",
        "name": "Move",
        "parentId": "onYourTurn",
        "order": 1,
        "description": "Move a distance up to your speed of [SPEED]. You may choose to use an action or move first, or move then do an action and then move again, up to your base speed.",
        "iconType": "walk"
      },
      {
        "id": "bonusAction",
        "name": "Bonus Action",
        "parentId": "onYourTurn",
        "order": 2,
        "description": "Some class features and spells allow you to make a bonus action, for example many cantrips (zero-th level spells) can be cast as a bonus action.",
        "iconType": "extra-time"
      },
      {
        "id": "freeAction",
        "name": "Free Action",
        "parentId": "onYourTurn",
        "order": 3,
        "description": "Some actions require neither action nor your move, or can be done while making another action. An example is shouting to communicate to another member, or interacting with an object.",
        "iconType": "talk"
      }
    ]
  },
  {
    "id": "onSomeoneElsesTurn",
    "name": "On someone else's turn",
    "order": 1,
    "contents": [
      {
        "id": "reaction",
        "name": "Reaction",
        "parentId": "onSomeoneElsesTurn",
        "order": 0,
        "description": "Certain special abilities, spells, and situations allow you to take a special action called a reaction. This is an instant response to a trigger of some kind, which can occur on your turn or on someone else's.",
        "usage": "Once per turn",
        "iconType": "surprised",
        "contents": [
          {
            "id": "attackOfOpportunity",
            "name": "Reaction: Attack of opportunity",
            "parentId": "reaction",
            "order": 0,
            "description": "If a creature is within your reach and moves away from you, you may make a free attack against it.",
            "usage": "Once per turn",
            "iconType": "blade-drag"
          }
        ]
      }
    ]
  },
  {
    "id": "commonActions",
    "name": "Common Actions",
    "order": 2,
    "contents": [
      {
        "id": "attack",
        "name": "Attack",
        "order": 0,
        "parentId": "commonActions",
        "description": "Use a weapon (or improvised weapon) to attempt to hit another creature. You must first roll a D20 against the target's AC (Armor Class), and if you are successful you may roll to see how much damage you inflict. The damage is based on your weapon and any bonuses from your class or feats.",
        "iconType": "crossed-swords",
        "contents": [
          {
            "id": "meleeAttack",
            "name": "Attack: Melee",
            "order": 0,
            "parentId": "attack",
            "description": "Attempt to hit a target using a weapon or weapons that you are wielding (or your fists). Target must be within reach (within [SPEED] feet).",
            "iconType": "sword-clash"
          },
          {
            "id": "rangedAttack",
            "name": "Attack: Ranged",
            "order": 1,
            "parentId": "attack",
            "description": "Attempt to hit a target using a ranged weapon. Target must be within the range specified by your weapon. Attempting to hit targets further than normal range will incur disadvantage on the to-hit roll.",
            "iconType": "high-shot"
          }
        ]
      },
      {
        "id": "dash",
        "name": "Dash",
        "order": 1,
        "parentId": "commonActions",
        "description": "Gain extra movement up to your base speed of [SPEED] feet. This effectively allows you to move twice as much in a turn, at the cost of not being able to do any other actions (like attack).",
        "usage": "Once per turn, up to [SPEED] feet",
        "iconType": "shield-bash"        
      },
      {
        "id": "castSpell",
        "name": "Cast a spell",
        "order": 2,
        "parentId": "commonActions",
        "description": "Cast a spell from your available spell slots, or from your list of memorised spells. Check the information for each spell, as a spell has its own range and cast time. Most spells require 1 action to cast, some (especially most cantrips) only require a bonus action to cast.",
        "usage": "Once per turn, usually consumes spell slot",
        "iconType": "bolt-spell-cast"
      }
    ]
  },
  {
    "id": "moreActions",
    "name": "More Actions",
    "order": 3,
    "contents": [
      {
        "id": "dodge",
        "name": "Dodge",
        "order": 0,
        "parentId": "moreActions",
        "description": "When you take the Dodge action, you focus entirely on avoiding attacks. Until the start of your next turn, any attack roll made against you has disadvantage if you can see the attacker, and you make Dexterity saving throws with advantage.",
        "usage": "Once per turn",
        "iconType": "acrobatic"
      },
      {
        "id": "help",
        "name": "Help",
        "order": 1,
        "parentId": "moreActions",
        "description": "You can lend your aid to another creature in the completion of a task. When you take the Help action, the creature you aid gains advantage on the next ability check it makes to perform the task you are helping with. Alternatively, you can aid a friendly creature in attacking a creature within 5 feet of you. You feint, distract the target, or in some other way team up to make your ally's attack more effective.",
        "usage": "Once per turn",
        "iconType": "convince"
      },
      {
        "id": "hide",
        "name": "Hide",
        "order": 2,
        "parentId": "moreActions",
        "description": "When you take the Hide action, you make a Dexterity (Stealth) check in an attempt to hide. If you succeed, you gain certain benefits.",
        "usage": "Once per turn",
        "iconType": "invisible"
      },
      {
        "id": "ready",
        "name": "Ready",
        "order": 3,
        "parentId": "moreActions",
        "description": "This action allows you to delay your turn, or in other words this allows you to act later in the round using your reaction. First you must decide on the trigger for your turn, then you decide on the action you will take in response to that action. For example: 'If the cultist steps on the trapdoor, I'll pull the lever that opens it'. When the trigger occurs, you can either take your reaction right after the trigger finishes or ignore the trigger.",
        "usage": "Once per turn",
        "iconType": "player-time"
      },
      {
        "id": "search",
        "name": "Search",
        "order": 4,
        "parentId": "moreActions",
        "description": "Devote your entire attention to finding something. Depending on the nature of the search, you may need to make further skill check (such as Wisdom - Perception or Intelligence - Investigation).",
        "usage": "Once per turn",
        "iconType": "magnifying-glass"
      },
      {
        "id": "useObject",
        "name": "Use an object",
        "order": 5,
        "parentId": "moreActions",
        "description": "This action is performed when an object requires your entire attention to interact with it, such as pulling a lever. You normally interact with an object while doing something else, such as drawing a sword as part of an attack. You can also perform this action if you want to interact with more than one object on your turn.",
        "usage": "Once per turn",
        "iconType": "pull"
      },
      {
        "id": "improvise",
        "name": "Improvise",
        "order": 6,
        "parentId": "moreActions",
        "description": "Attempt to do something else not listed here, at your DM's discretion!",
        "iconType": "egyptian-walk"
      }
    ]
  }
]